In [1]:
import pandas as pd

In [11]:
country_list = ['USA', 'Italy', 'France', 'Spain']
price_list = [13.99, 9.99, 12.99, 11.99]
data_one = zip(country_list, price_list)
ds_one = pd.DataFrame(data=data_one, columns = ['Country', 'Price'])
ds_one

  Country  Price
0     USA  13.99
1   Italy   9.99
2  France  12.99
3   Spain  11.99

In [12]:
region_list = ['Rioja', 'Bordeaux', 'Sicilia', 'Nappa']
variety_list = ['Red blend', 'Merlot', 'Primitivo', 'Chardonnay']
data_two = zip(region_list, variety_list)
s_two = pd.DataFrame(data=data_two, columns = ['Region', 'Variety'])
ds_two

     Region     Variety
0     Rioja   Red blend
1  Bordeaux      Merlot
2   Sicilia   Primitivo
3     Nappa  Chardonnay

In [13]:
ds_two['Origin'] = ["Spain", "France", "Italy", "USA"]

In [15]:
merged_ds = pd.merge(ds_one, ds_two, left_on = 'Country', right_on = 'Origin')
merged_ds

  Country  Price    Region     Variety  Origin
0     USA  13.99     Nappa  Chardonnay     USA
1   Italy   9.99   Sicilia   Primitivo   Italy
2  France  12.99  Bordeaux      Merlot  France
3   Spain  11.99     Rioja   Red blend   Spain

In [16]:
ds_one.index = ds_one['Country']
ds_two.index = ds_two['Origin']

In [18]:
joined_ds = ds_one.join(ds_two)
joined_ds

        Country  Price    Region     Variety  Origin
Country
USA         USA  13.99     Nappa  Chardonnay     USA
Italy     Italy   9.99   Sicilia   Primitivo   Italy
France   France  12.99  Bordeaux      Merlot  France
Spain     Spain  11.99     Rioja   Red blend   Spain